
# 1. כתוב פונקציה המגדירה רשימה הכוללת 10 מספרים שלמים, הפונקציה תדפיס את תא 3 מהרשימה ובשורה נוספת את תאים 2 עד 4 כולל מהרשימה
def f1():
    list1=[1,2,3,4,5,6,7,8,9,10]
    print(list1[2])
    print(list1[1:4])
    
# 2.   כתוב פונקציה המגדירה רשימה מהמספר 1 עד 10, הפונקציה תשנה את תאי הרשימה כך שבתאים ראשון עד רביעי הסדר מספרים עולה ובתאים חמישי עד שמיני כולל סדר המספרים יור שאר התאים הנותרים ימחקו
def f2():
    list1 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
    list1[4:10]=[8,7,6,5]
    print(list1)
# 3.     
def f3():
    list1 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
    print(list1)
    list1[6:10]=[12,11,10,9,8,7]
    print(list1)    
    
